In [29]:
import pandas as pd
A = pd.DataFrame(['Vietnam','United States','Iran','South Korea'],index = range(4))
B = pd.DataFrame(['Viet nam','United States','Iran','Korea','Japan'],index = range(5))
C = pd.DataFrame(['Viet nam','United States','Iran','Indonesia'])
A

               0
0        Vietnam
1  United States
2           Iran
3    South Korea

In [30]:
B

               0
0       Viet nam
1  United States
2           Iran
3          Korea
4          Japan

In [31]:
C

               0
0       Viet nam
1  United States
2           Iran
3      Indonesia

In [32]:
A.rename(columns={0:'Country'},inplace=True)
B.rename(columns={0:'Country Name'},inplace=True)
C.rename(columns={0:'Country Name'},inplace=True)

In [33]:
A

         Country
0        Vietnam
1  United States
2           Iran
3    South Korea

In [34]:
B

    Country Name
0       Viet nam
1  United States
2           Iran
3          Korea
4          Japan

In [35]:
C

    Country Name
0       Viet nam
1  United States
2           Iran
3      Indonesia

In [36]:
D = pd.merge(A,B,how='outer',left_on='Country',right_on='Country Name')
E = pd.merge(C,D,how='outer',left_on='Country Name',right_on='Country')

In [37]:
D

         Country   Country Name
0        Vietnam            NaN
1  United States  United States
2           Iran           Iran
3    South Korea            NaN
4            NaN       Viet nam
5            NaN          Korea
6            NaN          Japan

In [38]:
E

  Country Name_x        Country Country Name_y
0       Viet nam            NaN            NaN
1  United States  United States  United States
2           Iran           Iran           Iran
3      Indonesia            NaN            NaN
4            NaN        Vietnam            NaN
5            NaN    South Korea            NaN
6            NaN            NaN       Viet nam
7            NaN            NaN          Korea
8            NaN            NaN          Japan

In [39]:
D1 = pd.merge(A,B,how='inner',left_on='Country',right_on='Country Name')
E1 = pd.merge(C,D1,how='inner',left_on='Country Name',right_on='Country')

In [40]:
print(len(E)-len(E1))
print(len(E))
print(len(E1))

7
9
2

In [41]:
B.rename(columns={'Country Name':'Country'},inplace=True)
C.rename(columns={'Country Name':'Country'},inplace=True)

In [42]:
D = pd.merge(A,B,how='outer',left_on='Country',right_on='Country')
E = pd.merge(C,D,how='outer',left_on='Country',right_on='Country')

In [43]:
D1 = pd.merge(A,B,how='inner',on ='Country')
E1 = pd.merge(C,D1,how='inner',on='Country')

In [44]:
print(len(E)-len(E1))
print(len(E))
print(len(E1))

6
8
2